{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "UniversalAlt",
	"language": "en",
	"home_page_url": "https://universalalt.github.io/universal-alt/universal-alt/",
	"feed_url": "https://universalalt.github.io/universal-alt/feed/feed.json",
	"description": "UniversalALt project",
	"author": {
		"name": "Len Dierickx",
		"url": "https://sitefig.eu/"
	},
	"items": [
		{
			"id": "https://universalalt.github.io/universal-alt/blog/kick-off/",
			"url": "https://universalalt.github.io/universal-alt/blog/kick-off/",
			"title": "Building a Global Non-Profit for Accessibility: The Future of ALT Text for All Images",
			"content_html": "<h2 id=\"building-a-global-non-profit-for-accessibility-the-future-of-alt-text-for-all-images\" tabindex=\"-1\">Building a Global Non-Profit for Accessibility: The Future of ALT Text for All Images <a class=\"header-anchor\" href=\"https://universalalt.github.io/universal-alt/blog/kick-off/\">#</a></h2>\n<p>Accessibility is often an afterthought, especially when it comes to images on the internet. In most organizations, accessibility is not at the forefront of their marketing teams’ efforts—the very teams usually responsible for publishing content. One crucial example is the lack of ALT text for images, a practice that is frequently overlooked. ALT text is vital for visually impaired users, allowing them to engage with content that would otherwise be inaccessible. But how do we ensure that all images online, across multiple websites and platforms, become accessible?</p>\n<p>The solution lies in creating a worldwide database of ALT text for most, if not all, images. This ambitious vision would involve a non-profit foundation embedded at the core of the internet’s infrastructure. The idea is to work with major CMS platforms to integrate this ALT text database as the go-to source for images. By doing so, it won’t just be an afterthought but a fundamental feature in the online content publishing process.</p>\n<h3 id=\"how-the-solution-will-work\" tabindex=\"-1\">How the Solution Will Work <a class=\"header-anchor\" href=\"https://universalalt.github.io/universal-alt/blog/kick-off/\">#</a></h3>\n<p>The key to making this happen is technology—a combination of traditional AI, web crawling, and large language models (LLMs). These technologies would work together to create fact-based descriptions for images, using the language of the web page in question, supporting multiple languages. The result? ALT text that’s accurate, contextual, and most importantly, accessible.</p>\n<p>But this isn't just a one-size-fits-all approach. The system would allow for different ALT text preferences, tailoring descriptions based on the user's needs. Over time, a feedback loop would let manual updates from content authors improve the quality of the descriptions further. The ultimate goal would be to integrate this ALT text solution directly into CMS platforms, similar to how Gravatar works for profile pictures, based on the image URL or hash.</p>\n<p>The plan starts small but scales with impact. Initially, the focus would be on domains in Luxembourg, followed by .be, .fr, and other country-based top-level domains (TLDs). Commercial TLDs, like .com, would be targeted later. The technology for crawling and indexing these images at scale already exists. Once enough countries are on board, the focus would shift to working with major CMS platforms like WordPress, with the goal of getting this system integrated as part of the CMS’s core functionality.</p>\n<h3 id=\"why-a-non-profit-model\" tabindex=\"-1\">Why a Non-Profit Model? <a class=\"header-anchor\" href=\"https://universalalt.github.io/universal-alt/blog/kick-off/\">#</a></h3>\n<p>This project would be run as a non-profit organization. Funding would come from government grants and partnerships with mid-level tech companies. The focus is not on making money but on creating meaningful change for global accessibility. The ambition is clear: to increase engagement for visually impaired users, and in doing so, elevate the accessibility of the internet as a whole.</p>\n<p>While the initial implementation might not be perfect—AI and LLMs have their limitations, and some descriptions may inevitably be wrong—the upside outweighs these concerns. By describing even 70-80% of the world's images, the lives of many visually impaired individuals would be transformed. They would have the ability to interact with visual content in ways previously unimaginable.</p>\n<h3 id=\"overcoming-obstacles\" tabindex=\"-1\">Overcoming Obstacles <a class=\"header-anchor\" href=\"https://universalalt.github.io/universal-alt/blog/kick-off/\">#</a></h3>\n<p>Of course, this kind of solution is not without its challenges. Convincing CMS platforms to adopt this technology at scale will require significant effort, especially when it comes to embedding the solution into their core. A plugin might be the best first step, but long-term integration would solidify this project as a standard feature in web publishing.</p>\n<p>The environmental impact of AI is another valid concern, and the database may never be 100% accurate. But in a world where 99% of websites lack proper accessibility, we need to focus on innovation and impact rather than perfection. The existing blame game from accessibility consultants has done little to move the needle, and the time for preaching is over. What the world needs now is action, and this project aims to provide it.</p>\n<h3 id=\"final-thoughts-is-it-helpful\" tabindex=\"-1\">Final Thoughts: Is It Helpful? <a class=\"header-anchor\" href=\"https://universalalt.github.io/universal-alt/blog/kick-off/\">#</a></h3>\n<p>The question remains: will this be helpful? As someone deeply passionate about the issue, I believe the answer is a resounding yes. Sure, I might be an impatient dev with “hero syndrome,” but if my impatience leads to better accessibility for millions of people, I’m more than okay with that.</p>\n<p>I invite you to think about it: do you believe that a global database of ALT text could change the internet for the better? Do you see this as a worthwhile endeavor? Because the reality is, without such a solution, companies will continue to do nothing, and the internet will remain inaccessible to many.</p>\n<p>It’s time we start doing something that truly makes an impact.</p>\n",
			"date_published": "2024-09-19T00:00:00Z"
		}
		
	]
}
